app/Controllers/Categoris.php

SELECT *
FROM `categories`
---
    public function index()
    {
        $data['tes'] = $this->category->findAll();