app/Controllers/Location.php

    public function index()
    {
        $data['tes'] = $this->location->findAll();
---
SELECT *
FROM `locations`